resume old flow
Signed-off-by: Daniel Noland <daniel@githedgehog.com>
